---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemActiveTopDirn1
source: html/97728c40-f019-fd71-b2de-3869b05ca4eb.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemActiveTopDirn1 Property

"Top Major Direction"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemActiveTopDirn1 { get; }
```